'use strict'

// ООП - это парадигма программирования, основанного на концепции объектов.
// Объектами мы описываем реальные модели из жизни.
// Мы складываем все данные об объекте и его поведении внутрь
// Все приложение целиком строиться из этих объектов.

// ООП - разрабатывалось как решение проблемы структурирования приложения.

// Сlass - определяет структуру и обеспечивает простое создания объекта.

// Принципы ООП
// Абстракция
//  Выделение в моделируемом предмете важного для решения конкретойзадачи по предмету,
//  скрывая несущественные детали
// Инкапсуляция
//  Обеспечивает возможность приватных методов или свойства в классе, которые не были бы
//  доступны извне.
// Наследование
//  Позволяет наследовать данные и функциональность другого класса. Это позволяет
//  переиспользовать логику между классами
// Полиморфизм
//  Позволяет использовать объекты с одинаковым "интерфейсом" без информации о типе
//  и внутренней структуре объекта. 

