'use strict'
/**
 * Виды полиморфизма
 * - Ad-hock полиморфизм
 *    Возможность по разному исполнять функцию в зависимости от типа данных
 *    Пример:
 *    "2" + "4" (конкатенация)
 *    2 + 4 (сложение)
 * 
 * - Параметричский полиморфизм
 *    Когда мы можем выполнять одну и ту же функцию, но с разным типом аргументов
 *    Пример:
 *    console.log(1)
 *    console.log('str') и т.д.
 * 
 * Виды полиморфизма выше не совсем относятся к ООП. Чаще имеется в виду полиморфизм подтипов.
 * - Полиморфизм подтипов
 */
